/* Задача 2.
Написать программу, которая на входе принимает два числа
и выдаёт на выходе, какое число больше, а какое меньше
*/

/*
// Сначала выводим сообщения, предлагающие пользователю ввести по очереди
// два числа, и сохраняем введённые числа в переменных num1 и num2 соответственно,
// предварительно преобразовав символы в 32-х битовые числа.
Console.Write("Пожалуйста, введите первое число: ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Пожалуйста, введите второе число: ");
int num2 = Convert.ToInt32(Console.ReadLine());

// Дополнительно определим две переменные maxNum, которая получит значение
// наибольшего числа, и minNum, получающую значение наименьшего числа.
// Инициализируем их значением первого введённого числа.
int minNum = num1, maxNum = num1;

// Т.к. мы уже инициализировали дополнительные переменные значением
// первого введённого числа, то нам достаточно сравнить их значения
// со вторым введённым числом. Но на первом шаге сравним введённые
// числа между собой, предусмотрев возможность введения одинаковых чисел.
if (num1 == num2) Console.WriteLine("Введённые числа равны.");
else
{
    if (maxNum < num2) maxNum = num2;
    else minNum = num2;
    Console.WriteLine($"Наименьшее число: {minNum}; наибольшее число: {maxNum}");
}
*/

/* Задача 4.

*/